*** src/handlers.rs:12:5: replace handle_connection -> Result<(), ParseRequestError> with Ok(())

*** mutation diff:
--- src/handlers.rs
+++ replace handle_connection -> Result<(), ParseRequestError> with Ok(())
@@ -4,55 +4,17 @@
 };
 
 use crate::http::{ParseRequestError, Request, Response, ResponseBuilder};
 
 pub async fn handle_connection(
     mut stream: TcpStream,
     files_dir: &String,
 ) -> Result<(), ParseRequestError> {
-    let mut buf_reader = BufReader::new(&mut stream);
-
-    let request_str = std::str::from_utf8(buf_reader.fill_buf().await?)?;
-
-    let request = Request::try_from(request_str)?;
-
-    let path = request.uri.as_str();
-
-    let response = match path {
-        "/" => ResponseBuilder::ok()
-            .with(vec![
-                ("Connection", "Keep-Alive"),
-                ("Keep-Alive", "timeout=5, max=1000"),
-            ])
-            // Disable Content-Length header generation to pass codecrafters tests
-            .without_content_length_header()
-            .build(),
-
-        "/user-agent" => get_user_agent_response(&request),
-
-        other => {
-            if other.starts_with("/echo/") {
-                get_echo_response(other.trim_start_matches("/echo/"))
-            } else if path.starts_with("/files/") {
-                get_file_response(other.trim_start_matches("/files/"), files_dir)
-            } else {
-                ResponseBuilder::not_found().build()
-            }
-        }
-    };
-
-    stream
-        .write_all(response.to_bytes_vec().as_slice())
-        .await
-        .expect("Failed to write to stream");
-
-    stream.flush().await.expect("Failed to flush stream");
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_file_response(file_name: &str, files_dir: &String) -> Response {
     let path = format!("{}/{}", files_dir, file_name);
     let file = match std::fs::read(path) {
         Ok(file) => file,
         Err(_) => {
             return ResponseBuilder::not_found()

*** result: Success
