*** src/handlers.rs:54:5: replace get_file_response -> Response with Default::default()

*** mutation diff:
--- src/handlers.rs
+++ replace get_file_response -> Response with Default::default()
@@ -46,30 +46,17 @@
         .expect("Failed to write to stream");
 
     stream.flush().await.expect("Failed to flush stream");
 
     Ok(())
 }
 
 fn get_file_response(file_name: &str, files_dir: &String) -> Response {
-    let path = format!("{}/{}", files_dir, file_name);
-    let file = match std::fs::read(path) {
-        Ok(file) => file,
-        Err(_) => {
-            return ResponseBuilder::not_found()
-                .without_content_length_header()
-                .build()
-        }
-    };
-
-    ResponseBuilder::ok()
-        .with(("Content-Type", "application/octet-stream"))
-        .body(file)
-        .build()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_user_agent_response(request: &Request) -> Response {
     let user_agent = request
         .headers
         .iter()
         .find(|(k, _)| k == "User-Agent")
         .map(|(_, v)| v);

---- handlers::tests::test_get_file_response stdout ----
[src/handlers.rs:168:9] &file_path = "/var/folders/dk/rmy45p9s5bn3y62kyrkfh6440000gn/T/cargo-mutants-codecrafters-http-server-rust-eXV76S.tmp/tmp/files/test.txt"
thread 'handlers::tests::test_get_file_response' panicked at src/handlers.rs:181:9:
assertion `left == right` failed
  left: []
 right: [("Content-Type", "application/octet-stream"), ("Content-Length", "11")]

failures:
    handlers::tests::test_get_file_response

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
