*** src/handlers.rs:71:5: replace get_user_agent_response -> Response with Default::default()

*** mutation diff:
--- src/handlers.rs
+++ replace get_user_agent_response -> Response with Default::default()
@@ -63,29 +63,17 @@
 
     ResponseBuilder::ok()
         .with(("Content-Type", "application/octet-stream"))
         .body(file)
         .build()
 }
 
 fn get_user_agent_response(request: &Request) -> Response {
-    let user_agent = request
-        .headers
-        .iter()
-        .find(|(k, _)| k == "User-Agent")
-        .map(|(_, v)| v);
-
-    match user_agent {
-        Some(user_agent) => ResponseBuilder::ok()
-            .with(("Content-Type", "text/plain"))
-            .body(user_agent.as_bytes().to_vec())
-            .build(),
-        None => ResponseBuilder::bad_request().build(),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_echo_response(content: &str) -> Response {
     let response_builder = ResponseBuilder::ok().with(("Content-Type", "text/plain"));
 
     if content.is_empty() {
         response_builder.build()
     } else {

---- handlers::tests::test_get_user_agent_response_no_user_agent stdout ----
thread 'handlers::tests::test_get_user_agent_response_no_user_agent' panicked at src/handlers.rs:115:9:
assertion `left == right` failed
  left: Ok
 right: BadRequest

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:105:9:
assertion `left == right` failed
  left: []
 right: [("Content-Type", "text/plain"), ("Content-Length", "11")]

failures:
    handlers::tests::test_get_user_agent_response
    handlers::tests::test_get_user_agent_response_no_user_agent

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
