*** src/handlers.rs:74:26: replace == with != in get_user_agent_response

*** mutation diff:
--- src/handlers.rs
+++ replace == with != in get_user_agent_response
@@ -66,17 +66,17 @@
         .body(file)
         .build()
 }
 
 fn get_user_agent_response(request: &Request) -> Response {
     let user_agent = request
         .headers
         .iter()
-        .find(|(k, _)| k == "User-Agent")
+        .find(|(k, _)| k != /* ~ changed by cargo-mutants ~ */ "User-Agent")
         .map(|(_, v)| v);
 
     match user_agent {
         Some(user_agent) => ResponseBuilder::ok()
             .with(("Content-Type", "text/plain"))
             .body(user_agent.as_bytes().to_vec())
             .build(),
         None => ResponseBuilder::bad_request().build(),

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:116:9:
assertion `left == right` failed
  left: BadRequest
 right: Ok

failures:
    handlers::tests::test_get_user_agent_response

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
