*** src/handlers.rs:87:5: replace get_echo_response -> Response with Default::default()

*** mutation diff:
--- src/handlers.rs
+++ replace get_echo_response -> Response with Default::default()
@@ -79,23 +79,17 @@
             .with(("Content-Type", "text/plain"))
             .body(user_agent.as_bytes().to_vec())
             .build(),
         None => ResponseBuilder::bad_request().build(),
     }
 }
 
 fn get_echo_response(content: &str) -> Response {
-    let response_builder = ResponseBuilder::ok().with(("Content-Type", "text/plain"));
-
-    if content.is_empty() {
-        response_builder.build()
-    } else {
-        response_builder.body(content).build()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::http::{Request, StatusCode};
     use std::fs::OpenOptions;

---- handlers::tests::test_get_echo_response stdout ----
thread 'handlers::tests::test_get_echo_response' panicked at src/handlers.rs:144:9:
assertion `left == right` failed
  left: []
 right: [("Content-Type", "text/plain"), ("Content-Length", "13")]

failures:
    handlers::tests::test_get_echo_response

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
