*** src/http/error.rs:21:9: replace ParseRequestError::message -> &'static str with ""

*** mutation diff:
--- src/http/error.rs
+++ replace ParseRequestError::message -> &'static str with ""
@@ -13,23 +13,17 @@
     InvalidMethod,
     InvalidProtocol,
     InvalidRequest,
     NetworkError,
 }
 
 impl ParseRequestError {
     pub const fn message(&self) -> &'static str {
-        match self.kind {
-            ParseRequestErrorKind::InvalidRequest => "Invalid Request",
-            ParseRequestErrorKind::EncodingError => "Invalid Request Encoding",
-            ParseRequestErrorKind::InvalidMethod => "Invalid Request Method",
-            ParseRequestErrorKind::InvalidProtocol => "Invalid Request Protocol",
-            ParseRequestErrorKind::NetworkError => "Network I/O Error",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<Utf8Error> for ParseRequestError {
     fn from(_: Utf8Error) -> Self {
         Self {
             kind: ParseRequestErrorKind::EncodingError,
         }

*** result: Success
