*** src/http/error.rs:57:9: replace <impl Display for ParseRequestError>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/http/error.rs
+++ replace <impl Display for ParseRequestError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -49,11 +49,11 @@
         Self {
             kind: ParseRequestErrorKind::NetworkError,
         }
     }
 }
 
 impl Display for ParseRequestError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(f, "Request parsing error: {}", self.message())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
