*** src/http/method.rs:40:9: replace <impl Display for Method>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/http/method.rs
+++ replace <impl Display for Method>::fmt -> fmt::Result with Ok(Default::default())
@@ -32,24 +32,13 @@
             "TRACE" => Ok(Self::Trace),
             _ => Err(MethodError),
         }
     }
 }
 
 impl Display for Method {
     fn fmt(&self, f: &mut Formatter) -> fmt::Result {
-        let method = match self {
-            Self::Get => "GET",
-            Self::Post => "POST",
-            Self::Put => "PUT",
-            Self::Delete => "DELETE",
-            Self::Patch => "PATCH",
-            Self::Options => "OPTIONS",
-            Self::Head => "HEAD",
-            Self::Connect => "CONNECT",
-            Self::Trace => "TRACE",
-        };
-        write!(f, "{}", method)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub struct MethodError;

*** result: Success
