*** src/http/request.rs:101:62: replace + with - in get_next_word

*** mutation diff:
--- src/http/request.rs
+++ replace + with - in get_next_word
@@ -93,17 +93,17 @@
 
 fn get_next_word(request_line: &str) -> Option<(&str, &str)> {
     if request_line.is_empty() {
         return None;
     }
 
     for (i, c) in request_line.chars().enumerate() {
         if c == ' ' {
-            return Some((&request_line[..i], &request_line[i + 1..]));
+            return Some((&request_line[..i], &request_line[i - /* ~ changed by cargo-mutants ~ */ 1..]));
         }
     }
 
     Some((request_line, ""))
 }
 
 fn parse_header(header: &str) -> Option<(&str, &str)> {
     header.split_once(": ")

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:106:18:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidRequest }

---- handlers::tests::test_get_echo_response stdout ----
thread 'handlers::tests::test_get_echo_response' panicked at src/handlers.rs:137:85:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidRequest }

---- http::request::tests::test_get_next_word stdout ----
thread 'http::request::tests::test_get_next_word' panicked at src/http/request.rs:118:9:
assertion `left == right` failed: String slice incremental parsing
  left: Some(("GET", "T / HTTP/1.1"))
 right: Some(("GET", "/ HTTP/1.1"))

failures:
    handlers::tests::test_get_echo_response
    handlers::tests::test_get_user_agent_response
    handlers::tests::test_get_user_agent_response_no_user_agent
    http::request::tests::test_get_next_word
    http::request::tests::test_try_from_request

test result: FAILED. 15 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
