*** src/http/request.rs:109:5: replace parse_header -> Option<(&str, &str)> with None

*** mutation diff:
--- src/http/request.rs
+++ replace parse_header -> Option<(&str, &str)> with None
@@ -101,17 +101,17 @@
             return Some((&request_line[..i], &request_line[i + 1..]));
         }
     }
 
     Some((request_line, ""))
 }
 
 fn parse_header(header: &str) -> Option<(&str, &str)> {
-    header.split_once(": ")
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_get_next_word() {

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:106:18:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidRequest }

---- http::request::tests::test_try_from_request stdout ----
thread 'http::request::tests::test_try_from_request' panicked at src/http/request.rs:175:190:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidRequest }

---- http::request::tests::test_parse_header stdout ----
thread 'http::request::tests::test_parse_header' panicked at src/http/request.rs:239:9:
assertion `left == right` failed: Host header
  left: None
 right: Some(("Host", "localhost:4221"))

failures:
    handlers::tests::test_get_user_agent_response
    http::request::tests::test_parse_header
    http::request::tests::test_try_from_request

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
