*** src/http/request.rs:109:5: replace parse_header -> Option<(&str, &str)> with Some(("", "xyzzy"))

*** mutation diff:
--- src/http/request.rs
+++ replace parse_header -> Option<(&str, &str)> with Some(("", "xyzzy"))
@@ -101,17 +101,17 @@
             return Some((&request_line[..i], &request_line[i + 1..]));
         }
     }
 
     Some((request_line, ""))
 }
 
 fn parse_header(header: &str) -> Option<(&str, &str)> {
-    header.split_once(": ")
+    Some(("", "xyzzy")) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_get_next_word() {

---- http::request::tests::test_parse_header stdout ----
thread 'http::request::tests::test_parse_header' panicked at src/http/request.rs:239:9:
assertion `left == right` failed: Host header
  left: Some(("", "xyzzy"))
 right: Some(("Host", "localhost:4221"))

---- http::request::tests::test_try_from_request stdout ----
thread 'http::request::tests::test_try_from_request' panicked at src/http/request.rs:186:9:
assertion `left == right` failed: Host header with the value localhost:4221
  left: ("", "xyzzy")
 right: ("Host", "localhost:4221")

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:116:9:
assertion `left == right` failed
  left: BadRequest
 right: Ok

failures:
    handlers::tests::test_get_user_agent_response
    http::request::tests::test_parse_header
    http::request::tests::test_try_from_request

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
