*** src/http/request.rs:35:12: delete ! in <impl TryFrom for Request>::try_from

*** mutation diff:
--- src/http/request.rs
+++ delete ! in <impl TryFrom for Request>::try_from
@@ -27,17 +27,17 @@
 
         // Split the rest of the first line into the URI and the protocol
         let (uri, protocol) = get_next_word(rest_of_line).ok_or(ParseRequestError {
             kind: ParseRequestErrorKind::InvalidRequest,
         })?;
 
         let uri = uri.to_string();
 
-        if !uri.starts_with('/') {
+        if  /* ~ changed by cargo-mutants ~ */uri.starts_with('/') {
             return Err(ParseRequestError {
                 kind: ParseRequestErrorKind::InvalidRequest,
             });
         }
 
         // Ensure the protocol is HTTP/1.1
         if protocol != "HTTP/1.1" {
             // We can get an empty protocol if the method or URI are missing

---- handlers::tests::test_get_echo_response stdout ----
thread 'handlers::tests::test_get_echo_response' panicked at src/handlers.rs:137:85:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidRequest }

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:106:18:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidRequest }

---- handlers::tests::test_get_user_agent_response_no_user_agent stdout ----
thread 'handlers::tests::test_get_user_agent_response_no_user_agent' panicked at src/handlers.rs:123:77:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidRequest }

failures:
    handlers::tests::test_get_echo_response
    handlers::tests::test_get_user_agent_response
    handlers::tests::test_get_user_agent_response_no_user_agent
    http::request::tests::test_try_from_request

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
