*** src/http/request.rs:42:21: replace != with == in <impl TryFrom for Request>::try_from

*** mutation diff:
--- src/http/request.rs
+++ replace != with == in <impl TryFrom for Request>::try_from
@@ -34,17 +34,17 @@
 
         if !uri.starts_with('/') {
             return Err(ParseRequestError {
                 kind: ParseRequestErrorKind::InvalidRequest,
             });
         }
 
         // Ensure the protocol is HTTP/1.1
-        if protocol != "HTTP/1.1" {
+        if protocol == /* ~ changed by cargo-mutants ~ */ "HTTP/1.1" {
             // We can get an empty protocol if the method or URI are missing
             if protocol.is_empty() {
                 return Err(ParseRequestError {
                     kind: ParseRequestErrorKind::InvalidRequest,
                 });
             }
             return Err(ParseRequestError {
                 kind: ParseRequestErrorKind::InvalidProtocol,

---- handlers::tests::test_get_echo_response stdout ----
thread 'handlers::tests::test_get_echo_response' panicked at src/handlers.rs:137:85:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidProtocol }

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:106:18:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidProtocol }

---- handlers::tests::test_get_user_agent_response_no_user_agent stdout ----
thread 'handlers::tests::test_get_user_agent_response_no_user_agent' panicked at src/handlers.rs:123:77:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidProtocol }

failures:
    handlers::tests::test_get_echo_response
    handlers::tests::test_get_user_agent_response
    handlers::tests::test_get_user_agent_response_no_user_agent
    http::request::tests::test_try_from_request

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
