*** src/http/request.rs:95:5: replace get_next_word -> Option<(&str, &str)> with Some(("xyzzy", "xyzzy"))

*** mutation diff:
--- src/http/request.rs
+++ replace get_next_word -> Option<(&str, &str)> with Some(("xyzzy", "xyzzy"))
@@ -87,27 +87,17 @@
     let first_line = lines.next().ok_or(ParseRequestError {
         kind: ParseRequestErrorKind::InvalidRequest,
     });
 
     Ok((first_line?, lines))
 }
 
 fn get_next_word(request_line: &str) -> Option<(&str, &str)> {
-    if request_line.is_empty() {
-        return None;
-    }
-
-    for (i, c) in request_line.chars().enumerate() {
-        if c == ' ' {
-            return Some((&request_line[..i], &request_line[i + 1..]));
-        }
-    }
-
-    Some((request_line, ""))
+    Some(("xyzzy", "xyzzy")) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_header(header: &str) -> Option<(&str, &str)> {
     header.split_once(": ")
 }
 
 #[cfg(test)]
 mod tests {

---- http::request::tests::test_get_next_word stdout ----
thread 'http::request::tests::test_get_next_word' panicked at src/http/request.rs:108:9:
assertion `left == right` failed: String slice incremental parsing
  left: Some(("xyzzy", "xyzzy"))
 right: Some(("GET", "/ HTTP/1.1"))

---- handlers::tests::test_get_user_agent_response_no_user_agent stdout ----
thread 'handlers::tests::test_get_user_agent_response_no_user_agent' panicked at src/handlers.rs:123:77:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidMethod }

---- handlers::tests::test_get_echo_response stdout ----
thread 'handlers::tests::test_get_echo_response' panicked at src/handlers.rs:137:85:
called `Result::unwrap()` on an `Err` value: ParseRequestError { kind: InvalidMethod }

failures:
    handlers::tests::test_get_echo_response
    handlers::tests::test_get_user_agent_response
    handlers::tests::test_get_user_agent_response_no_user_agent
    http::request::tests::test_get_next_word
    http::request::tests::test_try_from_request

test result: FAILED. 15 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
