*** src/http/response.rs:14:9: replace Response::to_bytes_vec -> Vec<u8> with vec![]

*** mutation diff:
--- src/http/response.rs
+++ replace Response::to_bytes_vec -> Vec<u8> with vec![]
@@ -6,41 +6,17 @@
 pub struct Response {
     pub status_code: StatusCode,
     pub headers: Vec<(String, String)>,
     pub body: Option<Vec<u8>>,
 }
 
 impl Response {
     pub fn to_bytes_vec(&self) -> Vec<u8> {
-        let mut response: Vec<u8> = Vec::new();
-
-        let status_code: String = format!("{}", self.status_code);
-
-        let mut headers: Vec<u8> = self.headers.iter().fold(vec![], |mut acc, (k, v)| {
-            acc.extend_from_slice(k.as_bytes());
-            acc.extend_from_slice(b": ");
-            acc.extend_from_slice(v.as_bytes());
-            acc.extend_from_slice(b"\r\n");
-            acc
-        });
-
-        // Add additional CLRF after all headers
-        headers.extend_from_slice(b"\r\n");
-
-        if let Some(body) = &self.body {
-            response.extend_from_slice(status_code.as_bytes());
-            response.extend(headers);
-            response.extend_from_slice(body);
-        } else {
-            response.extend_from_slice(status_code.as_bytes());
-            response.extend(headers);
-        }
-
-        response
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Display for Response {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         let headers = self.headers.iter().fold(String::new(), |mut acc, (k, v)| {
             let _ = write!(acc, "{}: {}\r\n", k, v);
             acc

---- http::response::tests::test_response_to_bytes_vec stdout ----
thread 'http::response::tests::test_response_to_bytes_vec' panicked at src/http/response.rs:51:9:
assertion `left == right` failed: Response should be converted to bytes vector
  left: []

failures:
    http::response::tests::test_response_to_bytes_vec

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
