*** src/http/response.rs:44:9: replace <impl Display for Response>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/http/response.rs
+++ replace <impl Display for Response>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -36,32 +36,17 @@
         }
 
         response
     }
 }
 
 impl Display for Response {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        let headers = self.headers.iter().fold(String::new(), |mut acc, (k, v)| {
-            let _ = write!(acc, "{}: {}\r\n", k, v);
-            acc
-        });
-
-        if let Some(body) = &self.body {
-            write!(
-                f,
-                "{}{}\r\n{}",
-                self.status_code,
-                headers,
-                String::from_utf8_lossy(body)
-            )
-        } else {
-            write!(f, "{}{}\r\n", self.status_code, headers)
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use crate::http::ResponseBuilder;
 
     #[test]

---- http::response::tests::test_response_to_string stdout ----
thread 'http::response::tests::test_response_to_string' panicked at src/http/response.rs:75:9:
assertion `left == right` failed: Response should be converted to string
  left: ""
 right: "HTTP/1.1 200 OK\r\nContent-Type: text/plain\r\nContent-Length: 13\r\n\r\nHello, World!"

---- http::response_builder::tests::test_response_builder_default stdout ----
thread 'http::response_builder::tests::test_response_builder_default' panicked at src/http/response_builder.rs:236:9:
assertion `left == right` failed: Response string should be 200 OK
  left: ""
 right: "HTTP/1.1 200 OK\r\nContent-Length: 0\r\n\r\n"

failures:
    http::response::tests::test_response_to_string
    http::response_builder::tests::test_response_builder_default

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
