*** src/http/response_builder.rs:108:25: replace != with == in ResponseBuilder<S>::header

*** mutation diff:
--- src/http/response_builder.rs
+++ replace != with == in ResponseBuilder<S>::header
@@ -100,17 +100,17 @@
             ResponsePart::Header(key, value) => self.header(key, value),
             ResponsePart::Headers(headers) => self.headers(headers),
         }
     }
 
     fn header(mut self, key: impl Into<String>, value: impl Into<String>) -> Self {
         let key: String = key.into();
 
-        if key.as_str() != "Content-Length" {
+        if key.as_str() == /* ~ changed by cargo-mutants ~ */ "Content-Length" {
             if let Some(ref mut headers) = self.headers {
                 headers.push((key, value.into()));
             } else {
                 self.headers = Some(vec![(key, value.into())]);
             }
         }
 
         self

---- handlers::tests::test_get_echo_response stdout ----
thread 'handlers::tests::test_get_echo_response' panicked at src/handlers.rs:150:9:
assertion `left == right` failed
  left: [("Content-Length", "13")]
 right: [("Content-Type", "text/plain"), ("Content-Length", "13")]

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:117:9:
assertion `left == right` failed
  left: [("Content-Length", "11")]
 right: [("Content-Type", "text/plain"), ("Content-Length", "11")]

---- http::response::tests::test_response_to_string stdout ----
thread 'http::response::tests::test_response_to_string' panicked at src/http/response.rs:90:9:
assertion `left == right` failed: Response should be converted to string
  left: "HTTP/1.1 200 OK\r\nContent-Length: 13\r\n\r\nHello, World!"
 right: "HTTP/1.1 200 OK\r\nContent-Type: text/plain\r\nContent-Length: 13\r\n\r\nHello, World!"

failures:
    handlers::tests::test_get_echo_response
    handlers::tests::test_get_file_response
    handlers::tests::test_get_user_agent_response
    http::response::tests::test_response_to_bytes_vec
    http::response::tests::test_response_to_string
    http::response_builder::tests::test_response_builder_with
    http::response_builder::tests::test_without_content_length_header

test result: FAILED. 13 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
