*** src/http/response_builder.rs:124:53: replace != with == in ResponseBuilder<S>::headers

*** mutation diff:
--- src/http/response_builder.rs
+++ replace != with == in ResponseBuilder<S>::headers
@@ -116,17 +116,17 @@
         self
     }
 
     fn headers(mut self, headers: Vec<(impl Into<String>, impl Into<String>)>) -> Self {
         // Filter out the Content-Length header and convert headers' keys and values to owned strings
         let headers = headers
             .into_iter()
             .map(|(key, value)| -> (String, String) { (key.into(), value.into()) })
-            .filter(|(key, _)| key.clone().as_str() != "Content-Length")
+            .filter(|(key, _)| key.clone().as_str() == /* ~ changed by cargo-mutants ~ */ "Content-Length")
             .collect::<Vec<_>>();
 
         if let Some(ref mut existing_headers) = self.headers {
             existing_headers.extend(headers); // Extend existing headers
         } else {
             self.headers = Some(headers); // Set the headers
         }

---- http::response_builder::tests::test_response_builder_with stdout ----
thread 'http::response_builder::tests::test_response_builder_with' panicked at src/http/response_builder.rs:341:9:
assertion `left == right` failed: Three headers should be set
  left: 1
 right: 3

failures:
    http::response_builder::tests::test_response_builder_with

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
