*** src/http/response_builder.rs:14:9: replace ResponseBuilder<MissingStatusCode>::ok -> ResponseBuilder<StatusCode> with ResponseBuilder::from(Default::default())

*** mutation diff:
--- src/http/response_builder.rs
+++ replace ResponseBuilder<MissingStatusCode>::ok -> ResponseBuilder<StatusCode> with ResponseBuilder::from(Default::default())
@@ -6,20 +6,17 @@
     status_code: S,
     headers: Option<Vec<(String, String)>>,
     body: Option<Vec<u8>>,
     set_content_length_header: bool,
 }
 
 impl ResponseBuilder<MissingStatusCode> {
     pub fn ok() -> ResponseBuilder<StatusCode> {
-        ResponseBuilder {
-            status_code: StatusCode::Ok,
-            ..Default::default()
-        }
+        ResponseBuilder::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn not_found() -> ResponseBuilder<StatusCode> {
         ResponseBuilder {
             status_code: StatusCode::NotFound,
             ..Default::default()
         }
     }

*** result: Success
