*** src/http/response_builder.rs:21:9: replace ResponseBuilder<MissingStatusCode>::not_found -> ResponseBuilder<StatusCode> with ResponseBuilder::from(Default::default())

*** mutation diff:
--- src/http/response_builder.rs
+++ replace ResponseBuilder<MissingStatusCode>::not_found -> ResponseBuilder<StatusCode> with ResponseBuilder::from(Default::default())
@@ -13,20 +13,17 @@
     pub fn ok() -> ResponseBuilder<StatusCode> {
         ResponseBuilder {
             status_code: StatusCode::Ok,
             ..Default::default()
         }
     }
 
     pub fn not_found() -> ResponseBuilder<StatusCode> {
-        ResponseBuilder {
-            status_code: StatusCode::NotFound,
-            ..Default::default()
-        }
+        ResponseBuilder::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn bad_request() -> ResponseBuilder<StatusCode> {
         ResponseBuilder {
             status_code: StatusCode::BadRequest,
             ..Default::default()
         }
     }

---- http::response_builder::tests::test_response_builder_not_found stdout ----
thread 'http::response_builder::tests::test_response_builder_not_found' panicked at src/http/response_builder.rs:253:9:
assertion `left == right` failed: Status code should be 404 Not Found
  left: Ok
 right: NotFound

failures:
    http::response_builder::tests::test_response_builder_not_found

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
