*** src/http/response_builder.rs:28:9: replace ResponseBuilder<MissingStatusCode>::bad_request -> ResponseBuilder<StatusCode> with ResponseBuilder::from(Default::default())

*** mutation diff:
--- src/http/response_builder.rs
+++ replace ResponseBuilder<MissingStatusCode>::bad_request -> ResponseBuilder<StatusCode> with ResponseBuilder::from(Default::default())
@@ -20,20 +20,17 @@
     pub fn not_found() -> ResponseBuilder<StatusCode> {
         ResponseBuilder {
             status_code: StatusCode::NotFound,
             ..Default::default()
         }
     }
 
     pub fn bad_request() -> ResponseBuilder<StatusCode> {
-        ResponseBuilder {
-            status_code: StatusCode::BadRequest,
-            ..Default::default()
-        }
+        ResponseBuilder::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn internal_server_error() -> ResponseBuilder<StatusCode> {
         ResponseBuilder {
             status_code: StatusCode::InternalServerError,
             ..Default::default()
         }
     }

---- handlers::tests::test_get_user_agent_response_no_user_agent stdout ----
thread 'handlers::tests::test_get_user_agent_response_no_user_agent' panicked at src/handlers.rs:127:9:
assertion `left == right` failed
  left: Ok
 right: BadRequest

---- http::response_builder::tests::test_response_builder_bad_request stdout ----
thread 'http::response_builder::tests::test_response_builder_bad_request' panicked at src/http/response_builder.rs:263:9:
assertion `left == right` failed: Status code should be 400 Bad Request
  left: Ok
 right: BadRequest

failures:
    handlers::tests::test_get_user_agent_response_no_user_agent
    http::response_builder::tests::test_response_builder_bad_request

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
