*** src/http/response_builder.rs:35:9: replace ResponseBuilder<MissingStatusCode>::internal_server_error -> ResponseBuilder<StatusCode> with ResponseBuilder::from(Default::default())

*** mutation diff:
--- src/http/response_builder.rs
+++ replace ResponseBuilder<MissingStatusCode>::internal_server_error -> ResponseBuilder<StatusCode> with ResponseBuilder::from(Default::default())
@@ -27,20 +27,17 @@
     pub fn bad_request() -> ResponseBuilder<StatusCode> {
         ResponseBuilder {
             status_code: StatusCode::BadRequest,
             ..Default::default()
         }
     }
 
     pub fn internal_server_error() -> ResponseBuilder<StatusCode> {
-        ResponseBuilder {
-            status_code: StatusCode::InternalServerError,
-            ..Default::default()
-        }
+        ResponseBuilder::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ResponseBuilder<StatusCode> {
     pub fn build(self) -> Response {
         // Calculate the Content-Length header value
         let content_length = self.body.as_ref().map(|b| b.len()).unwrap_or(0);
         let mut headers = self.headers.unwrap_or_default();

---- http::response_builder::tests::test_response_builder_internal_server_error stdout ----
thread 'http::response_builder::tests::test_response_builder_internal_server_error' panicked at src/http/response_builder.rs:273:9:
assertion `left == right` failed: Status code should be 500 Internal Server Error
  left: Ok
 right: InternalServerError

failures:
    http::response_builder::tests::test_response_builder_internal_server_error

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
