*** src/http/response_builder.rs:45:9: replace ResponseBuilder<StatusCode>::build -> Response with Default::default()

*** mutation diff:
--- src/http/response_builder.rs
+++ replace ResponseBuilder<StatusCode>::build -> Response with Default::default()
@@ -37,30 +37,17 @@
             ..Default::default()
         }
     }
 }
 
 impl ResponseBuilder<StatusCode> {
     pub fn build(self) -> Response {
         // Calculate the Content-Length header value
-        let content_length = self.body.as_ref().map(|b| b.len()).unwrap_or(0);
-        let mut headers = self.headers.unwrap_or_default();
-
-        // Set the Content-Length header if the `without_content_length_header` method was not called
-        match self.set_content_length_header {
-            false => (), // No Content-Length header for empty bodies
-            true => headers.push(("Content-Length".to_string(), content_length.to_string())),
-        }
-
-        Response {
-            status_code: self.status_code,
-            headers,
-            body: self.body,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<S> ResponseBuilder<S> {
     /// # Set header(s) on the response.
     ///
     /// You can set a single header multiple times, or multiple headers at once.
     ///

---- handlers::tests::test_get_user_agent_response stdout ----
thread 'handlers::tests::test_get_user_agent_response' panicked at src/handlers.rs:117:9:
assertion `left == right` failed
  left: []
 right: [("Content-Type", "text/plain"), ("Content-Length", "11")]

---- handlers::tests::test_get_echo_response stdout ----
thread 'handlers::tests::test_get_echo_response' panicked at src/handlers.rs:150:9:
assertion `left == right` failed
  left: []
 right: [("Content-Type", "text/plain"), ("Content-Length", "13")]

---- handlers::tests::test_get_user_agent_response_no_user_agent stdout ----
thread 'handlers::tests::test_get_user_agent_response_no_user_agent' panicked at src/handlers.rs:127:9:
assertion `left == right` failed
  left: Ok
 right: BadRequest

failures:
    handlers::tests::test_get_echo_response
    handlers::tests::test_get_file_response
    handlers::tests::test_get_user_agent_response
    handlers::tests::test_get_user_agent_response_no_user_agent
    http::response::tests::test_response_to_bytes_vec
    http::response::tests::test_response_to_string
    http::response_builder::tests::test_response_builder_bad_request
    http::response_builder::tests::test_response_builder_body
    http::response_builder::tests::test_response_builder_default
    http::response_builder::tests::test_response_builder_internal_server_error
    http::response_builder::tests::test_response_builder_not_found
    http::response_builder::tests::test_response_builder_with

test result: FAILED. 7 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
