*** src/http/status_code.rs:14:9: replace StatusCode::message -> &'static str with "xyzzy"

*** mutation diff:
--- src/http/status_code.rs
+++ replace StatusCode::message -> &'static str with "xyzzy"
@@ -6,22 +6,17 @@
     Ok = 200,
     BadRequest = 400,
     NotFound = 404,
     InternalServerError = 500,
 }
 
 impl StatusCode {
     pub fn message(&self) -> &'static str {
-        match self {
-            StatusCode::Ok => "OK",
-            StatusCode::BadRequest => "Bad Request",
-            StatusCode::NotFound => "Not Found",
-            StatusCode::InternalServerError => "Internal Server Error",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Display for StatusCode {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> FmtResult {
         write!(f, "HTTP/1.1 {} {}\r\n", *self as u16, self.message())
     }
 }

---- http::response::tests::test_response_to_bytes_vec stdout ----
thread 'http::response::tests::test_response_to_bytes_vec' panicked at src/http/response.rs:75:9:
assertion `left == right` failed: Response should be converted to bytes vector

---- http::response::tests::test_response_to_string stdout ----
thread 'http::response::tests::test_response_to_string' panicked at src/http/response.rs:90:9:
assertion `left == right` failed: Response should be converted to string
  left: "HTTP/1.1 200 xyzzy\r\nContent-Type: text/plain\r\nContent-Length: 13\r\n\r\nHello, World!"
 right: "HTTP/1.1 200 OK\r\nContent-Type: text/plain\r\nContent-Length: 13\r\n\r\nHello, World!"

---- http::response_builder::tests::test_response_builder_default stdout ----
thread 'http::response_builder::tests::test_response_builder_default' panicked at src/http/response_builder.rs:236:9:
assertion `left == right` failed: Response string should be 200 OK
  left: "HTTP/1.1 200 xyzzy\r\nContent-Length: 0\r\n\r\n"
 right: "HTTP/1.1 200 OK\r\nContent-Length: 0\r\n\r\n"

failures:
    http::response::tests::test_response_to_bytes_vec
    http::response::tests::test_response_to_string
    http::response_builder::tests::test_response_builder_default
    http::status_code::tests::status_code_display
    http::status_code::tests::status_code_message

test result: FAILED. 15 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
