*** src/http/thread_pool.rs:50:9: replace ThreadPool::execute with ()

*** mutation diff:
--- src/http/thread_pool.rs
+++ replace ThreadPool::execute with ()
@@ -42,20 +42,17 @@
 
         Self {
             workers,
             sender: tx,
         }
     }
 
     pub fn execute<F: FnOnce() + Send + 'static>(&self, f: F) {
-        let job = Box::new(f);
-        self.sender
-            .send(job)
-            .expect("Worker we are sending to has died!");
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Worker {
     fn new(id: usize, receiver: Arc<Mutex<mpsc::Receiver<Job>>>) -> Worker {
         let thread = std::thread::Builder::new()
             .spawn(move || loop {
                 let job = receiver

*** result: Success
